[
  {
    "id": 1,
    "title": "Speedmates",
    "description": "Real-time chat app for uni students to connect based on shared interests—built it because group finding was a nightmare.",
    "detailedDescription": "Finding people at uni who were actually on your wavelength was surprisingly hard, so we built Speedmates to fix that. It's a real-time chat platform where students match based on interests and courses. Used Spring Boot for the backend because I wanted something solid, and React for the frontend. The WebSocket implementation was probably the most interesting part—getting real-time messaging to actually feel instant took some work.",
    "tech": ["Spring Boot", "React", "WebSocket", "PostgreSQL", "Java"],
    "date": "2024",
    "status": "completed",
    "links": {
      "repo": "https://github.com/m7anj/speedmates"
    },
    "highlights": [
      "Built full real-time messaging system with WebSockets",
      "Interest-based matching algorithm for students",
      "Actually got used by people at uni"
    ],
    "features": [
      "Real-time messaging with instant delivery",
      "Interest-based user matching",
      "Course and module filtering",
      "User profiles with shared interests",
      "Group chat functionality"
    ]
  },
  {
  "id": 2,
  "title": "NLP News Classifier",
  "icon": "📰",
  "description": "An intelligent news classification system that uses real NLP techniques and neural networks to automatically understand and categorize news articles.",
  "detailedDescription": "This project was built as a deep dive into practical natural language processing and machine learning. Instead of relying on simple keyword matching, the classifier cleans and processes raw news text, lemmatizes it using Stanford CoreNLP, transforms words into meaningful numerical representations with GloVe embeddings, and feeds them into a neural network built with DeepLearning4J. The goal was to understand how modern NLP pipelines work end to end—from raw text to structured predictions—while experimenting with vector semantics, optimization strategies, and preprocessing techniques. It’s not just a demo; it’s a hands-on exploration of how machines learn to read the news.",
  "tech": [
    "Java",
    "Natural Language Processing",
    "Machine Learning",
    "Stanford CoreNLP",
    "DeepLearning4J",
    "GloVe"
  ],
  "date": "2024",
  "status": "completed",
  "links": {
    "repo": "https://github.com/m7anj/AdvancedNewsClassifier"
  },
  "highlights": [
    "Neural-network-based news classification",
    "Word embeddings with pre-trained GloVe vectors",
    "Full NLP preprocessing pipeline with lemmatization and stop-word removal"
  ],
  "features": [
    "Automatic categorization of news articles",
    "Text cleaning and normalization",
    "Lemmatization using Stanford CoreNLP",
    "Semantic word representation via GloVe embeddings",
    "Neural network training optimized with Adam optimizer",
    "Support for multiple news categories"
  ]
},
  {
    "id": 3,
    "title": "Lyra - Voice-to-Music Platform",
    "icon": "🎵",
    "description": "During BirmingHack 2025, we built a voice-to-music platform that turns voice descriptions into actual music using Deepgram's API.",
    "detailedDescription": "Hackathon project that we wanted to use, since Neuphonic was there (they provide ultra low-latency TTS API's), and we wanted to win a bounty they had set out. The idea was simple... describe what you want to hear, and it generates music for you. Used Deepgram's API specifically for voice recognition because it's fast, then built the music generation on top. Had 48 hours to build it, so the code isn't perfect, and we used tools like Claude Code and Cursor to help with our short-lived planning and development, but it worked well enough to win. Judges seemed impressed by how quickly it could go from 'Stop, wait a minute' to a preview of 'Uptown Funk from Bruno Mars' they were singing.",
    "tech": ["Deepgram API", "Python", "React", "Node.js"],
    "date": "Jan 2025",
    "status": "completed",
    "links": {
      "demo": "https://youtu.be/pVjNPJCaHSw"
    },
    "highlights": [
      "Won BirmingHack 2025",
      "Real-time voice processing",
      "Built in 48 hours"
    ],
    "features": [
      "Voice-to-text with Deepgram",
      "Natural language music generation",
      "Real-time audio playback",
      "Genre and mood customization"
    ]
  },
  {
    "id": 4,
    "title": "ResumeTail",
    "description": "Chrome extension that suggests resume improvements based on job postings—currently building this.",
    "detailedDescription": "Got tired of manually tweaking my resume for every application, so I'm building a Chrome extension that does it for me. You're looking at a job posting, click the extension, and it analyzes both the posting and your resume to suggest specific improvements. Still working on it, but the AI integration is coming together nicely. Uses Claude's API to understand context properly rather than just keyword stuffing.",
    "tech": ["JavaScript", "Chrome Extension API", "Claude API", "React"],
    "date": "2025",
    "status": "in-progress",
    "links": {
      "repo": "https://github.com/m7anj/resumetail"
    },
    "highlights": [
      "AI-powered resume analysis",
      "Job description parsing",
      "Context-aware suggestions"
    ],
    "features": [
      "One-click job posting analysis",
      "Resume optimization suggestions",
      "Keyword gap identification",
      "Before/after comparison",
      "Export optimized versions"
    ]
  },
  {
    "id": 7,
    "title": "Personal Portfolio Website",
    "icon": "🌐",
    "description": "The site you're looking at—built from scratch using my own initiative and AI-assisted development because I wanted full control over everything.",
    "detailedDescription": "Could've used a template, but that isn't unique enough. So, using AI tools and UI/UX design strategies, I built a portfolio site in React to showcase projects and experience. Focused on clean design, fast load times, and actually being responsive on mobile. It's also a chance to experiment with new tech and design ideas without clients being up my *ss!",
    "tech": ["React", "JavaScript", "CSS", "Netlify"],
    "date": "2024",
    "status": "completed",
    "links": {
      "demo": "https://manjeev.fun"
    },
    "features": [
      "Responsive design that actually works",
      "Project showcases with live demos",
      "Fast load times",
      "Clean, minimal interface"
    ]
  }
]
